---
type: MEPFamilyConnectorInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# MEPFamilyConnectorInfo

`Autodesk.Revit.DB.MEPFamilyConnectorInfo` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAssociateFamilyParameterId | 2017 | `public ElementId GetAssociateFamilyParameterId ( ElementId connectorParameterId )` |
| Method | GetConnectorParameterValue | 2017 | `public ParameterValue GetConnectorParameterValue ( ElementId connectorParameterId )` |